INSERT INTO `users` (
	`identity`,
	`login`,
	`password`,
	`role`
) VALUES (
	2,
	"user1",
	"EE11CBB19052E40B07AAC0CA060C23EE", /* MD5 хэш пароля "user" */
	1
), (
	3,
	"user2",
	"EE11CBB19052E40B07AAC0CA060C23EE", /* MD5 хэш пароля "user" */
	2
);

INSERT INTO `readers`
(`identity`, `surname`,  `name`,    `patronymic`, `library_card_number`, `address`,               `phone`)
VALUES
(1,          "Иванов",   "Иван",    "Иванович",   "2006-09-11-001",      "ул. Покровского, 13-3", "+375 (29) 123-45-67"),
(2,          "Петров",   "Пётр",    "Петрович",   "2008-12-15-001",      "пр-т Будёного, 3А-43",  "+375 (29) 234-56-78"),
(3,          "Сидоров",  "Сидор",   "Сидорович",  "2008-12-15-002",      "переул. Смирнова, 7",   "+375 (29) 345-67-89"),
(4,          "Васильев", "Василий", "Васильевич", "2007-03-02-001",      "ул. Чапаева, 112-5-97", "+375 (29) 456-78-90");

INSERT INTO `authors`
(`identity`, `surname`,     `name`,      `patronymic`,    `year_of_birth`, `year_of_death`)
VALUES
(1,          "Пушкин",      "Александр", "Сергеевич",     1799,            1837),
(2,          "Лермонтов",   "Михаил",    "Юрьевич",       1814,            1841),
(3,          "Есенин",      "Сергей",    "Александрович", 1895,            1925),
(4,          "Толстой",     "Лев",       "Николаевич",    1828,            1910),
(5,          "Окуджава",    "Булат",     "Шалвович",      1924,            1997),
(6,          "Достоевский", "Фёдор",     "Михайлович",    1821,            1881);

INSERT INTO `books`
(`identity`, `inventory_number`, `author_identity`, `title`,                                       `year`)
VALUES
(1,          "АБ000001",         1,                 "Сказка о царе Салтане",                       1980),
(2,          "ЧЗ000001",         1,                 "Сказка о царе Салтане",                       1980),
(3,          "АБ000002",         1,                 "Сказка о мёртвой царевне и о семи богатырях", 1985),
(4,          "ЧЗ000002",         1,                 "Сказка о мёртвой царевне и о семи богатырях", 1985),
(5,          "АБ000003",         1,                 "Евгений Онегин",                              1975),
(6,          "ЧЗ000003",         1,                 "Евгений Онегин",                              1975),
(7,          "АБ000004",         2,                 "Мцыри",                                       1990),
(8,          "ЧЗ000004",         2,                 "Мцыри",                                       1990),
(9,          "АБ000005",         2,                 "Сказка для детей",                            1995),
(10,         "ЧЗ000005",         2,                 "Сказка для детей",                            1995),
(11,         "АБ000006",         4,                 "Война и мир",                                 1992),
(12,         "ЧЗ000006",         4,                 "Война и мир",                                 1992),
(13,         "АБ000007",         4,                 "Сказка об Иване-дураке и его двух братьях",   1996),
(14,         "ЧЗ000007",         4,                 "Сказка об Иване-дураке и его двух братьях",   1996),
(15,         "ЧЗ000008",         5,                 "Песенка о ночной Москве",                     2011),
(16,         "АБ000008",         6,                 "Преступление и наказание",                    1965),
(17,         "АБ000009",         6,                 "Братья Карамазовы",                           1967),
(18,         "АБ000010",         6,                 "Идиот",                                       1968),
(19,         "АБ000011",         NULL,              "Слово о полку Игореве",                       1971);

INSERT INTO `usages`
(`book_identity`, `reader_identity`, `delivery_date`, `plan_return_date`, `return_date`)
VALUES
(1,               1,                 "2006-09-11",    "2006-09-21",       "2006-12-27"),
(3,               1,                 "2006-12-27",    "2007-01-06",       "2007-01-30"),
(3,               1,                 "2007-01-30",    "2007-02-09",       "2007-05-13"),
(13,              1,                 "2007-05-13",    "2007-05-23",       NULL),
(6,               2,                 "2008-12-15",    "2008-12-15",       "2008-12-15"),
(6,               2,                 "2008-12-16",    "2008-12-16",       "2008-12-16"),
(8,               2,                 "2008-12-17",    "2008-12-17",       "2008-12-17"),
(15,              2,                 "2008-12-17",    "2008-12-17",       "2008-12-17"),
(8,               4,                 "2007-03-02",    "2007-03-02",       "2007-03-02"),
(11,              4,                 "2007-03-02",    "2027-03-02",       NULL),
(16,              2,                 "2009-01-01",    "2009-02-01",       "2009-01-27"),
(16,              2,                 "2010-05-01",    "2010-06-01",       NULL),
(17,              2,                 "2010-05-01",    "2010-06-01",       NULL),
(18,              2,                 "2010-05-01",    "2010-06-01",       NULL),
(19,              2,                 "2010-05-10",    "2010-06-10",       NULL);